// 2. Напишите цикл для определения четных чисел от 1 до 15.
// Реализуйте эту задачу тремя видами циклов. Вывод цикла должен содержать:
// Число 1. Нечетное;
// Число 2. Четное;
// Число 3. Нечетное и т.д.

// Вариант 1.
// for (var i = 1; i <= 15; i++) {
//     let result = (i%2 == 00)? "Число " + i+". Четное;" : "Число " + i+". Нечетное;"
//     console.log( result );
// }

// Вариант 2.
// var i = 1;
// while (i <= 15){
//     let result = (i%2 == 00)? "Число " + i+". Четное;" : "Число " + i + ". Нечетное;"
//     console.log( result );
//     i++;
// }

// Вариант 3
// var i = 1;
// do{
//     let result = (i%2 == 00)? "Число " + i+". Четное;" : "Число " + i + ". Нечетное;"
//     console.log( result );
//     i++;
// }while (i <= 15);

